{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "RBERT"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "finetuning_task": "semeval",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Other",
    "1": "Author-Organization(e1,e2)",
    "10": "Content-Container(e2,e1)",
    "11": "Entity-Origin(e1,e2)",
    "12": "Entity-Origin(e2,e1)",
    "13": "Entity-Destination(e1,e2)",
    "14": "Entity-Destination(e2,e1)",
    "15": "Component-Whole(e1,e2)",
    "16": "Component-Whole(e2,e1)",
    "17": "Member-Collection(e1,e2)",
    "18": "Member-Collection(e2,e1)",
    "19": "Message-Topic(e1,e2)",
    "2": "Author-Organization(e2,e1)",
    "20": "Message-Topic(e2,e1)",
    "3": "Cause-Effect(e1,e2)",
    "4": "Cause-Effect(e2,e1)",
    "5": "Instrument-Agency(e1,e2)",
    "6": "Instrument-Agency(e2,e1)",
    "7": "Product-Producer(e1,e2)",
    "8": "Product-Producer(e2,e1)",
    "9": "Content-Container(e1,e2)"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Author-Organization(e1,e2)": 1,
    "Author-Organization(e2,e1)": 2,
    "Cause-Effect(e1,e2)": 3,
    "Cause-Effect(e2,e1)": 4,
    "Component-Whole(e1,e2)": 15,
    "Component-Whole(e2,e1)": 16,
    "Content-Container(e1,e2)": 9,
    "Content-Container(e2,e1)": 10,
    "Entity-Destination(e1,e2)": 13,
    "Entity-Destination(e2,e1)": 14,
    "Entity-Origin(e1,e2)": 11,
    "Entity-Origin(e2,e1)": 12,
    "Instrument-Agency(e1,e2)": 5,
    "Instrument-Agency(e2,e1)": 6,
    "Member-Collection(e1,e2)": 17,
    "Member-Collection(e2,e1)": 18,
    "Message-Topic(e1,e2)": 19,
    "Message-Topic(e2,e1)": 20,
    "Other": 0,
    "Product-Producer(e1,e2)": 7,
    "Product-Producer(e2,e1)": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.25.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
